TRUE
CLIPS> (clear)
CLIPS> (release-mem)
4967 ;; A different number is OK
CLIPS> (mem-used)
52109 ;; Reference mem-used number
CLIPS> (load-facts bigbug.dat)
TRUE
CLIPS> (clear)
CLIPS> (release-mem)
379567 ;; A different number is OK
CLIPS> (mem-used)
52109 ;; Should be the same as above
CLIPS> (load bigbug.clp)
:
TRUE
CLIPS> (reset)
CLIPS> (clear)
CLIPS> (release-mem)
379702 ;; A different number is OK
CLIPS> (mem-used)
52109 ;; Should be the same as above
CLIPS> (dribble-off)
